:PROPERTIES:
:ID:       85185dd2-56d6-4d56-842e-49486b768c85
:END:
#+title: ENG305 - Transmission Lines and Electromagnetic Waves - Lab 1
#+date: [2025-04-16 Wed 08:18]
#+AUTHOR: Baley Eccles - 652137
#+STARTUP: latexpreview
#+FILETAGS: :Assignment:UTAS:2025:
#+LATEX_HEADER: \usepackage[a4paper, margin=2cm]{geometry}
#+LATEX_HEADER_EXTRA: \usepackage{minted}
#+LATEX_HEADER_EXTRA: \usepackage{fontspec}
#+LATEX_HEADER_EXTRA: \setmonofont{Iosevka}
#+LATEX_HEADER_EXTRA: \setminted{fontsize=\small, frame=single, breaklines=true}
#+LATEX_HEADER_EXTRA: \usemintedstyle{emacs}
#+LATEX_HEADER: \usepackage[style=apa, backend=biber]{biblatex}
#+LATEX_HEADER: \DeclareLanguageMapping{english}{english-apa}
#+LATEX_HEADER_EXTRA: \usepackage{float}

yingjink@utas.edu.au

beccles@utas.edu.au

*** 2
Using:
\[u_p = \lambda f\]
\[4l = \lambda\]
\[\frac{4}{3}l = \lambda\]
We can get $f \in (10\ 000, 30\ 000)$ we chose $20kHz$

| Load      |     1 |     2 |     3 |     4 |     5 |     6 |     7 |     8 |   9 |    10 |    11 |    12 |    13 |
| OC        |     1 |  1.16 |  1.23 | 1.167 | 0.967 |   0.7 | 0.333 | 0.133 | 0.5 | 0.833 |   1.1 | 1.233 | 1.233 |
| SC        | 1.033 | 0.633 |   0.2 |   0.3 |   0.7 |   1.1 |  1.33 | 1.433 | 1.4 |   1.2 | 0.867 | 0.467 | 0.033 |
| $Z_0=250$ |   0.8 | 0.933 | 0.967 |   0.9 | 0.767 | 0.600 |   0.4 | 0.367 | 0.5 |   0.7 | 0.867 | 0.933 | 0.933 |
| ?         |   0.5 | 0.667 |   0.8 |   0.9 |   0.9 | 0.833 |   0.7 | 0.533 | 0.4 | 0.433 | 0.567 | 0.733 | 0.833 |

#+BEGIN_SRC octave :exports none :results output :session Q1
clc
clear
close all
OC = [1,1.16,1.23,1.167,0.967,0.7,0.333,0.133,0.5,0.833,1.1,1.233,1.233];
OC_VSWR = max(OC)/min(OC)
SC = [1.033,0.633,0.2,0.3,0.7,1.1,1.33,1.433,1.4,1.2,0.867,0.467,0.033];
SC_VSWR = max(SC)/min(SC)
Z0 = [0.8,0.933,0.967,0.9,0.767,0.600,0.4,0.367,0.5,0.7,0.867,0.933,0.933];
Z0_VSWR = max(Z0)/min(Z0)
Mystery = [0.5,0.667,0.8,0.9,0.9,0.833,0.7,0.533,0.4,0.433,0.567,0.733,0.833];
Mystery_VSWR = max(Mystery)/min(Mystery)
t = 1:1:length(OC);
figure;
plot(t,OC)
figure;
plot(t,SC)
figure;
plot(t,Z0)
figure;
plot(t,Mystery)
#+END_SRC

#+RESULTS:
: OC_VSWR = 9.2707
: SC_VSWR = 43.424
: Z0_VSWR = 2.6349
: Mystery_VSWR = 2.2500
^ Are wrong
